import { useState } from "react";
import "../Styles/TamilContent.css";


function TamilContent() {
  return (
    <div className="tamil-content-container">
      <h2>முன்னுரை</h2>
      <p>
        திருவிதாங்கூர்: இந்தியாவின் கேரள மாநிலத்தின் தென் பகுதிகளையும்
        தமிழ்நாட்டின், கன்னியாகுமரி, மாவட்டத்தையும் உள்ளாக்கியிருந்த ஒரு மன்னர்
        அரசு ஆகும். கி.பி 1158-ல் வோட்டின் கடைசி மன்னர். பால மார்த்தாண்ட வர்மா
        மர்மமான முறையில் மரணமடைந்த பின் மலபார் பகுதியை ஆண்டு வந்த நம்பூதிரி -
        நாயர் கூட்டணி ஆட்சி வேணாட்டு அரசை கைப்பற்றியது. இதன் முதல் மன்னர்
        கார்த்திகை திருநாள் ராமவர்மன். இவர் காலத்திலிருந்து வேணாடு மன்னன் பால
        மார்த்தாண்ட வர்மா காலத்தில் தலைநகர் கல்குளத்திலிருந்து திருவனந்தபுரத்தையே
        தலைநகராக கொண்டு ஆட்சி புரிந்து வந்தனர்.
      </p>
      <p>
        தொழில்: அந்த காலகட்டத்தில் சிறு கூட்டமாக வாழ்ந்து கொண்டிருந்த ஒரு
        வீ.பழங்குடி இலம் நாடோடிகளாக இடம் விட்டு இடம்பெயர்ந்து வாழ்ந்துள்ளனர்.
        தேன் எடுத்தல், கைவினை பொருட்கள் செய்தல், நம்பூதிரிகள் மாந்திரிகங்கள் சில
        அறிந்து கற்றுக்கொண்டனர். அதன்பின் அவர்களின் தொழில்களில் குறி சொல்லுதலும்
        ஆவிகளை விரட்டுதலும், கோடாங்கி (உடுக்கை) அடித்து குறி செல்லுதலும் இணைந்து
        இன்று அறவும் தொடர்கிறது.
      </p>
      <p>
        1949 ஜீலை 1 -ஆம் நாள் திருவிதாங்கூர் கொச்சி மாநிலம் ஏற்படுத்தப்பபட்டு
        திருவிதாங்கூர் மன்னர். சித்திரை திருநாள் பலராம வர்மா புதிய மாநிலத்தின்
        இராஜப்பிரமுக், பதவி ஏற்றார். தென் திருவிதாங்கூர் தமிழ் பேசும் பகுதி.
        அருகில் உள்ள சென்னை மாநிலத்திலுள்ள இணைக் வேண்டி போராட்டம் நடைபெற்றது.
      </p>
      <p>
        இந்த போராட்டம் வன்முறை கலவரமாக மாறிய நிலையில் இந்த பழங்குடி இன மக்கள்,
        பல உள்ளூர் மக்கள், மார்த்தாண்டம் மற்றும் புதுக்கடை ஆகிய இடங்களில்,
        கலவரத்தின் போது கொல்லப்பட்டனர். மாநில மறுமுறை திருத்தி அமைத்தல்
        சட்டத்தின் கீழ், திருவிதாங்கூரின் நான்கு தாலுகா பகுதிகளான தோவனை,
        அகதீஷ்வரம், கல்குளம் மற்றும் விளவங்கோடு மற்றும் செங்கோட்டையின் ஒரு
        பகுதி, சென்னை மாநிலத்தோடு இணைக்கப்பட்டது.
      </p>
      <p>
        வாழ்க்கை முறை மற்றும் கலாச்சாரம்: ஒரு சிலர் மற்ற சில துறைகளில் வேலைகள்
        செய்து கொண்டிருக்கின்றனர், தங்களுடைய சமுதாய முன்னேற்றத்திற்காக
        இன்றளவும் போரடி கொண்டிருக்கின்றார். அவர்கள் குல தொழில்களில் குறி சொல்லுதல்,
        கோடங்கி, ஆவி மற்றும் பேய் விரட்டுதல், கைவினை பொருட்கள் செய்து விற்பனை
        செய்தல் போன்றவற்றை தொடர்ச்சியாக செய்துகொண்டுள்ளனர்.
      </p>
    </div>
  );
}

export default TamilContent;
